/*----------------------------------------------------------------
 * 作    者 ：姜  彦 
 * 项目名称 ：Clone
 * 类 名 称 ：EntityStateModel 
 * 命名空间 ：Clone
 * CLR 版本 ：4.0.30319.42000
 * 创建时间 ：2018/12/13 11:31:44
 * 当前版本 ：1.0.0.1 
 * My Email ：jiangyan2008.521@gmail.com 
 *            jiangyan2008.521@qq.com   
 * 描述说明： 
 * 
 * 修改历史： 
 * 
*******************************************************************
 * Copyright @ JiangYan 2018. All rights reserved.
*******************************************************************
------------------------------------------------------------------*/


namespace Clone
{
    /// <summary>
    /// 对象状态类
    /// </summary>
    public class EntityStateModel
    {
        public string Name { get; set; }
        public string OriginalValue { get; set; }
        public string CurrentValue { get; set; }
    }
}

/*----------------------------------------------------------------
 * 备    注 ：
 * 
 * 
 * 
*******************************************************************
 * Copyright @ JiangYan 2018. All rights reserved.
*******************************************************************
------------------------------------------------------------------*/
